# EncryptAllPlugins

## Description
This will do batch encryption of all VectorScript plug-ins in the Plug-ins folder.

```pascal
PROCEDURE EncryptAllPlugins;
```

```python
def vs.EncryptAllPlugins():
    return None
```

## Remarks
This function is provided by an external plug-in that is not provided by the normal distribution of Vectorworks.

You need to install the <code>Script Batch Process</code> feature from the <code>Vectorworks Developer</code> section of <code>Help → Install Partner Products...</code> menu command.

More info, see here Prepare Release Plugins

Additionally, the plug-in is called ‘BatchEncryption’ and can be found inside ‘ToolsWin’ or ‘ToolsMac’ folders of the corresponding Vectorworks SDKs.

The Vectorworks SDK can be downloaded here:
http://www.vectorworks.net/support/custom/sdk/sdkdown.php

## Examples
```pascal
EncryptAllPlugins;
```
```python
import vs

# This will do batch encryption of all VectorScript plug-ins in the Plug-ins
# folder.
vs.EncryptAllPlugins()
```

## See Also
* EncryptPlugin
* TestEncryptPlugins

## Version
Availability: from Vectorworks 2014

## Category
* Utility